app/views/alums/_form.html.erb

SELECT `profs`.* FROM `profs`
---
    <%= form.label :prof_id %>
    <%= form.select :prof_id, options_from_collection_for_select(Prof.all, 'id', 'nombre', @alum.prof_id) %>

SELECT `idioms`.* FROM `idioms`
---
    <%= form.label :idiom_id %>
    <%= form.select :idiom_id, options_from_collection_for_select(Idiom.all, 'id', 'nivel', @alum.idiom_id) %>