app/controllers/alums_controller.rb

  def index
    @alums = Alum.all
---
SELECT `alums`.* FROM `alums`

  def create
    @alum = Alum.new(alum_params)

    respond_to do |format|
      if @alum.save
---
INSERT INTO `alums` (`matricula`, `nombre`, `apellidos`, `foto`, `correo`, `prof_id`, `idiom_id`, `created_at`, `updated_at`) VALUES (2014020423, 'Cosijoeza', 'Melchor Nolasco', 'estudiante_30.jpg', 'cosi.melchor@gmail.com', 1, 1, '2018-02-09 00:24:14', '2018-02-09 00:24:14')

    def set_alum
      @alum = Alum.find(params[:id])
---
SELECT  `alums`.* FROM `alums` WHERE `alums`.`id` = 1 LIMIT 1