app/controllers/alum_mats_controller.rb

SELECT `alum_mats`.* FROM `alum_mats`
---
  def index
    @alum_mats = AlumMat.all

INSERT INTO `alum_mats` (`alum_id`, `mat_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-02-12 04:44:38', '2018-02-12 04:44:38')
---
  def create
    @alum_mat = AlumMat.new(alum_mat_params)

    respond_to do |format|
      if @alum_mat.save

SELECT  `alum_mats`.* FROM `alum_mats` WHERE `alum_mats`.`id` = 1 LIMIT 1
SELECT  `mats`.* FROM `mats` WHERE `mats`.`id` = 1 LIMIT 1
---
    def set_alum_mat
      @alum_mat = AlumMat.find(params[:id])