app/controllers/ents_controller.rb

  def index
    @ents = Ent.all
---
SELECT `ents`.* FROM `ents`