app/controllers/historials_controller.rb

SELECT `historials`.* FROM `historials`
---
  def index
    @historials = Historial.all