app/controllers/idioms_controller.rb

SELECT `idioms`.* FROM `idioms`
---
  def index
    @idioms = Idiom.all

INSERT INTO `idioms` (`nivel`, `semestre`, `estado`, `created_at`, `updated_at`) VALUES ('PET-1', '1', 'Cursando', '2018-02-09 00:23:33', '2018-02-09 00:23:33')
---
  def create
    @idiom = Idiom.new(idiom_params)

    respond_to do |format|
      if @idiom.save

SELECT  `idioms`.* FROM `idioms` WHERE `idioms`.`id` = 1 LIMIT 1
---
    def set_idiom
      @idiom = Idiom.find(params[:id])