app/controllers/mats_controller.rb

  def index
    @mats = Mat.all
---
SELECT `mats`.* FROM `mats`

  def create
    @mat = Mat.new(mat_params)

    respond_to do |format|
      if @mat.save
---
INSERT INTO `mats` (`nombre`, `calif_1`, `calif_2`, `calif_3`, `final`, `ext_1`, `ext_2`, `esp`, `semestre`, `created_at`, `updated_at`) VALUES ('Ecuaciones diferenciales', 5.0, 4.0, 3.0, 0.0, 0.0, 0.0, 0.0, '3', '2018-02-12 04:37:52', '2018-02-12 04:37:52')

    def set_mat
      @mat = Mat.find(params[:id])
---
SELECT  `mats`.* FROM `mats` WHERE `mats`.`id` = 1 LIMIT 1