app/controllers/profs_controller.rb

  def index
    @profs = Prof.all
---
SELECT `profs`.* FROM `profs`

  def create
    @prof = Prof.new(prof_params)

    respond_to do |format|
      if @prof.save
---
INSERT INTO `profs` (`nombre`, `usuario`, `correo`, `instituto`, `created_at`, `updated_at`) VALUES ('Arturo de labarrera', 'arturo', 'arturito@gmail.com', 'computacion', '2018-02-09 00:23:08', '2018-02-09 00:23:08')

    def set_prof
      @prof = Prof.find(params[:id])
---
SELECT  `profs`.* FROM `profs` WHERE `profs`.`id` = 1 LIMIT 1