app/controllers/tutors_controller.rb

SELECT `tutors`.* FROM `tutors`
---
  def index
    @tutors = Tutor.all